{
  "bio": "Родился 21 мая 1974 года в Челябинской области. Окончил Челябинский государственный университет. Кандидат юридических наук. В 1991-2006 годах&nbsp;&mdash; секретарь судебного заседания районного суда города Челябинска, юрист ряда акционерных обществ, начальник юридического отдела, начальник юридического управления Челябинского акционерного коммерческого банка &ldquo;Челиндбанк&rdquo;. В 1999 году&nbsp;&mdash; консультант по правовым вопросам кандидата в депутаты Госдумы Михаила Гришанкова. В 2000 году работал в региональном штабе кандидата в президенты Владимира Путина. С 2000 по 2007 год&nbsp;&mdash; депутат Законодательного собрания Челябинской области III-IV созывов. В 2008 году&nbsp;&mdash; заместитель руководителя Уральского Межрегионального координационного совета ВПП &ldquo;Единая Россия&rdquo;. С 2014 года&nbsp;&mdash; старший научный сотрудник Института проблем административно-правового регулирования НИУ &ldquo;Высшая школа экономики&rdquo;. Был руководителем областного представительства &ldquo;Союзной общественной палаты России и Беларуси&rdquo;. С 2007 года &mdash; депутат Государственной Думы пятого, шестого, седьмого созывов.",
  "birth_date": "1974-05-21",
  "comments": "",
  "commission": null,
  "committee": "Первый заместитель председателя комитета ГД по развитию гражданского общества, вопросам общественных и религиозных объединений",
  "committees": [],
  "conclusion": "<p>Дмитрий Вяткин &mdash; потомственный юрист, сын бывшего главного челябинского судьи. В прошлом созыве Госдумы <a href=\"https://echo.msk.ru/guests/544795-echo/\">был</a> заместителем председателя комитета ГД по конституционному судопроизводству, а также официальным представителем Госдумы в Конституционном суде. В Госдуме вносит&nbsp;законопроекты, регулирующие судебную систему РФ, а также различные поправки в КоАП, УК и УПК. Например, Вяткин выступил соавтором законопроекта об усилении ответственности за неисполнение приговора суда или&nbsp;решения суда (<a href=\"http://sozd.duma.gov.ru/bill/468839-7\">№468839-7</a>) и единственным автором законопроекта о возможности участвовать в судебных заседаниях удаленно через видео-конференц-связь (<a href=\"http://sozd.duma.gov.ru/bill/460541-7\">№460541-7</a>). Законопроект&nbsp;<a href=\"http://sozd.duma.gov.ru/bill/460541-7\">№460541-7</a>&nbsp;<a href=\"https://pravo.ru/news/203983/\">позволил</a>&nbsp;привлекать&nbsp;на заседания для дачи показаний по административным делам тех, кто находится в СИЗО или колонии по другому делу.&nbsp;В Госдуме VI созыва депутат внес законопроект <a href=\"http://sozd.duma.gov.ru/bill/642105-6\">№642105-6</a>, <a href=\"https://pravo.ru/news/view/113203/\">наделяющий</a> руководителя Судебного департамента при Верховном суде РФ новыми полномочиями. Согласно законопроекту,&nbsp;сам департамент станет более независимым и <a href=\"https://pravo.ru/review/view/111802/\">сможет</a> осуществлять финансирование за счет федерального бюджета не только&nbsp;федеральных судов, мировых судей и органов судейского сообщества, но и своих подведомственных&nbsp;учреждений.&nbsp;Поэтому мы можем отнести депутата к группе интересов&nbsp;судейского сообщества.</p>\r\n",
  "convocations": [
    "V",
    "VI",
    "VII"
  ],
  "duma_id": 99110933,
  "edited": true,
  "election_method": "партийный список",
  "end_date": null,
  "family": "Женат.",
  "fraction": "Единая Россия",
  "fraction_group": "Группа Кидяева В.Б.",
  "fullname": "Вяткин Дмитрий Федорович",
  "gender": "M",
  "goverment_body": null,
  "groups": [
    11723
  ],
  "hidden": false,
  "id": 10249,
  "last_appointment": null,
  "last_import": "2019-01-23T17:31:30.887984",
  "person": 169,
  "photo": "https://declarator.org/media/lobbist/%D0%92%D1%8F%D1%82%D0%BA%D0%B8%D0%BD_%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%B8%D0%B9_%D0%A4%D0%B5%D0%B4%D0%BE%D1%80%D0%BE%D0%B2%D0%B8%D1%87.png",
  "position": "Депутат Государственной думы V-VII созывов, избран в составе федерального списка партии &ldquo;Единая Россия&rdquo;",
  "region": null,
  "relations": "<p>Женат. Имеет сына и двух дочерей. По данным базы Контур.Фокус, Дмитрий Вяткин входит в число учредителей <a href=\"https://focus.kontur.ru/entity?query=1037402907365\">гаражно-строительного кооператива &ldquo;Танкист&rdquo;</a>. <a href=\"http://www.compromat.ru/page_32937.htm\">Брат</a> Дмитрия Вяткина, Михаил Федорович Вяткин, ранее был учредителем и директором <a href=\"https://focus.kontur.ru/humanentity?query=745302116260\">нескольких небольших фирм</a>, зарегистрированных по одному адресу: ООО &ldquo;Софит&rdquo;, ООО &ldquo;Геликон&rdquo;, ООО &ldquo;Аструм&rdquo;, ООО &ldquo;Радиант&rdquo;. Все фирмы занимаются управлением недвижимостью. Сейчас учредителем и директором этих&nbsp;организаций является Нина Тимофеевна Вяткина,&nbsp;<a href=\"http://news-sirotin.com/novosti/21274\">мать</a> Михаила и Дмитрия Вяткиных. <a href=\"https://cheltoday.ru/articles/obshchestvo/sledovateli_urfo_vyyasnyayut_proiskhozhdenie_sobstvennosti_fedora_vyatkina-7403/\">Отец</a> депутата&nbsp;Федор&nbsp;Михайлович&nbsp;Вяткин -&nbsp;<a href=\"http://chel-oblsud.ru/?html=h_p9\">председатель</a>&nbsp;Челябинского областного суда с 1988 года по 2013 год. По <a href=\"http://cheltoday.ru/articles/obshchestvo/sledovateli_urfo_vyyasnyayut_proiskhozhdenie_sobstvennosti_fedora_vyatkina-7403/\">данным</a> СМИ, в 2013 году Федор Вяткин жил в коттедже, собственником которого является юридическое лицо &mdash; фирма <a href=\"https://focus.kontur.ru/entity?query=1027403876389\">ООО предприятие &ldquo;Дивизион&rdquo;</a>. Основным учредителем этой фирмы является племянник Федора Вяткина Петр Конарев, ранее учредителем была его жена Светлана Конарева. Вторым учредителем&nbsp;был Анатолий Полухин, которого <a href=\"http://cheltoday.ru/articles/obshchestvo/sledovateli_urfo_vyyasnyayut_proiskhozhdenie_sobstvennosti_fedora_vyatkina-7403/\">называют</a> близким к Вяткину человеком.</p>\r\n",
  "site": "D",
  "start_year": null,
  "submitted": "В Госдуме VII созыва Дмитрий Вяткин стал автором нескольких законопроектов, касающихся деятельности НКО и общественных объединений: законопроекты об ограничении участия граждан в формировании Общественной палаты РФ (<a href=\"http://sozd.parlament.gov.ru/bill/55549-7\">№55549-7</a>), о дополнении членов общественных наблюдательных комиссий (<a href=\"http://sozd.parlament.gov.ru/bill/103511-7\">№103511-7</a>), о совершенствовании порядка рассмотрения обращений граждан, в том числе в форме электронного документа (<a href=\"http://sozd.parlament.gov.ru/bill/220209-7\">№220209-7</a>), о поддержке социально-ориентированных НКО (<a href=\"http://sozd.parlament.gov.ru/bill/19252-7\">№19252-7</a>, <a href=\"http://sozd.parlament.gov.ru/bill/19263-7\">№19263-7</a>). Вяткин вносит поправки в КоАП, УК и УПК, а также законопроекты, регулирующие судебную систему (<a href=\"http://sozd.parlament.gov.ru/bill/273154-7\">№273154-7</a>, <a href=\"http://sozd.parlament.gov.ru/bill/273154-7\">№273154-7</a>). Соавтор законопроектов, ужесточающих правила проведения публичных мероприятий: пакет законопроектов о введении обязанности организатора уведомить уполномоченный орган власти в случае отказа от проведения публичного мероприятия не позднее, чем за один день до мероприятия и установлении административной ответственности за невыполнение организатором соответствующей обязанности (<a href=\"http://sozd.parliament.gov.ru/bill/468834-7\">№468834-7</a>, <a href=\"http://sozd.parliament.gov.ru/bill/468798-7\">№468798-7</a>).",
  "temp_commission": null,
  "terms_number": null,
  "total_years": null,
  "verified": true,
  "vote_link": "http://vote.duma.gov.ru/?convocation=AAAAAAA7&deputy=99110933&sort=date_desc"
}