import DOMPurify from "isomorphic-dompurify";

function processContent(html) {
  // Иконка кавычек в формате SVG
  const quoteIcon = `
    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="23" viewBox="0 0 28 23" fill="none">
      <path fill-rule="evenodd" clip-rule="evenodd" d="M12.7727 8.09086C12.7727 11.3443 11.89 14.2232 10.1244 16.7275C8.35885 19.2319 5.99043 21.3188 3.01914 22.9883C2.88995 23.0311 2.68541 22.9562 2.4055 22.7636C2.1256 22.5709 1.89952 22.3676 1.72727 22.1536C1.55502 21.9395 1.40431 21.672 1.27512 21.3509C1.14593 21.0298 1.14593 20.8265 1.27512 20.7409C2.73923 19.7563 3.9988 18.7503 5.05383 17.7228C6.10885 16.6954 6.63636 15.1115 6.63636 12.9711C6.63636 12.4574 6.60407 12.0935 6.53947 11.8794C6.47488 11.6654 6.35646 11.5584 6.18421 11.5584C6.05502 11.5584 5.91507 11.5905 5.76435 11.6547C5.61364 11.7189 5.43062 11.751 5.21531 11.751C3.96651 11.751 2.86842 11.3122 1.92105 10.4346C0.973684 9.55706 0.5 8.17648 0.5 6.29289C0.5 4.70897 1.04904 3.26417 2.14713 1.9585C3.24522 0.652834 4.6555 0 6.37799 0C8.31579 0 9.86603 0.770558 11.0287 2.31168C12.1914 3.85279 12.7727 5.77919 12.7727 8.09086ZM27.5 8.09086C27.5 11.3443 26.6172 14.2232 24.8517 16.7275C23.0861 19.2319 20.7177 21.3188 17.7464 22.9883C17.6172 23.0311 17.4127 22.9562 17.1328 22.7636C16.8529 22.5709 16.6268 22.3676 16.4545 22.1536C16.2823 21.9395 16.1316 21.672 16.0024 21.3509C15.8732 21.0298 15.8732 20.8265 16.0024 20.7409C17.4665 19.7563 18.7261 18.7503 19.7811 17.7228C20.8361 16.6954 21.3636 15.1115 21.3636 12.9711C21.3636 12.4574 21.3313 12.0935 21.2667 11.8794C21.2022 11.6654 21.0837 11.5584 20.9115 11.5584C20.7823 11.5584 20.6423 11.5905 20.4916 11.6547C20.3409 11.7189 20.1579 11.751 19.9426 11.751C18.6938 11.751 17.5957 11.3122 16.6483 10.4346C15.701 9.55706 15.2273 8.17648 15.2273 6.29289C15.2273 4.70897 15.7763 3.26417 16.8744 1.9585C17.9725 0.652834 19.3828 0 21.1053 0C23.0431 0 24.5933 0.770558 25.756 2.31168C26.9187 3.85279 27.5 5.77919 27.5 8.09086Z" fill="#363636"/>
    </svg>
  `;

  // Функция для замены тегов цитат
  const replaceQuotes = (match) => {
    return `<blockquote className="custom-quote">${quoteIcon}${match.slice(
      12,
      -13
    )}</blockquote>`;
  };

  // Функция для обработки изображений
  const processImages = (match) => {
    const altMatch = match.match(/alt="([^"]*)"/);
    const alt =
      altMatch && altMatch[1] && altMatch[1].trim() !== "" ? altMatch[1] : null;
    return `<figure className="image-with-caption">
      ${match}
      ${alt ? `<figcaption>${alt}</figcaption>` : ""}
    </figure>`;
  };

  // Заменяем все теги <blockquote> с помощью регулярного выражения
  let processedHtml = html.replace(
    /<blockquote>[\s\S]*?<\/blockquote>/g,
    replaceQuotes
  );

  // Заменяем все теги <img> с помощью регулярного выражения
  processedHtml = processedHtml.replace(/<img[^>]+>/g, processImages);

  // Очищаем HTML от потенциально опасных элементов
  processedHtml = DOMPurify.sanitize(processedHtml, {
    ADD_TAGS: ["svg", "path", "figure", "figcaption"],
    ADD_ATTR: ["fill-rule", "clip-rule", "fill", "viewBox", "className"],
  });

  // Заменяем все оставшиеся 'class' на 'className'
  processedHtml = processedHtml.replace(/class="/g, 'className="');

  return processedHtml;
}

export default processContent;
